---
kind: other
id: Methods.T:Autodesk.Revit.DB.ImageInstance
source: html/17ff1a41-9d8e-5394-2cb8-fa0d5bcc532b.htm
---
# ImageInstance Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.